<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.dataJAR-recipes.munki.VPT8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VPT8</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>apps/VPT8</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Video Projection Tool (VPT) is a free multipurpose realtime projection software tool for Mac and Windows.</string>
            <key>display_name</key>
            <string>VPT8</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.haircut.pkg.VPT8</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>	
</dict>
</plist>
