<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of LXFree and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.dataJAR-recipes.munki.US-20x20SettingsPanel</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>US-20x20_SettingsPanel</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>US-20x20 - 20-Channel USB Audio Interface / Digital Mixer Settings Panel</string>
            <key>developer</key>
            <string>Tascam</string>
            <key>display_name</key>
            <string>US-20x20_SettingsPanel</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
     <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.US-20x20SettingsPanel</string>
    <key>Process</key>
    <array>
    <dict>
        <key>Processor</key>
        <string>Unarchiver</string>
        <key>Arguments</key>
        <dict>
            <key>destination_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%</string>
            <key>purge_destination</key>
            <true/>
        </dict>
    </dict>
    <dict>
        <key>Processor</key>
        <string>FileFinder</string>
        <key>Arguments</key>
        <dict>
            <key>pattern</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%/US-20x20_*.dmg</string>
        </dict>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>source_pkg</key>
            <string>%found_filename%/US-20x20.pkg</string>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
        </dict>
        <key>Processor</key>
        <string>PkgCopier</string>
    </dict>
    <dict>
        <key>Arguments</key>
        <dict>
            <key>pkg_path</key>
            <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
            <key>repo_subdirectory</key>
            <string>%MUNKI_REPO_SUBDIR%</string>
        </dict>
        <key>Processor</key>
        <string>MunkiImporter</string>
    </dict>
    </array>
</dict>
</plist>
